#include "protheus.ch"


/*
+----------+----------+-------+--------------------------------------------------------------+------+------------+
| Funcao   |MTA105LIN | Autor | Karina Bittencourt                                           | Data | 05/10/2026 |
+----------+----------+-------+--------------------------------------------------------------+------+------------+
|Descricao: Adiciona botão para importar rateio via Excel                                                        |
+---------------------+------------------------------------------------------------------------------------------+
|Uso especifico na Valenet                                                                                       |
+----------+----------+------------------------------------------------------------------------------------------+  
*/

User Function MA120BUT()
    Local aBotoes := {}

    AAdd(aBotoes, { "NOTE", { || U_ImpRatPC() }, "Importar Rateio", "Importar Rateio Excel" })

Return aBotoes
